//13. Разстояние
// Два обекта започват от точка А и пътуват в една и съща посока с постоянни скорости V1 и V2
// за период T. Напишете JS функция, която изчислява разстоянието между двата обекта в края
// на периода.
// Входът идва като масив. Първите два елемента са скоростите в км / час, а третият елемент е
// времето в секунди.
// Изходът трябва да бъде отпечатан на конзолата.
// Изчислете разстоянието в метри.
// Малко помощ:
// Скоростта, времето и разстоянието са свързани помежду си със следната формула:
// Първо трябва да се изравнят входящите. Има 3600 секунди за час и 1000 метра на километър.
// Не знаем кой обект е изминал по-голямо разстояние!

function distanceTime([speed1, speed2, timeInHours]){

    [speed1, speed2, timeInHours] = [speed1, speed2, timeInHours].map(Number);
    let s1 = [speed1] * [timeInHours];
    let s2 = [speed2] * [timeInHours];

    let distancebetweenobjects = s1 - s2;


    console.log('Разстоянието между 2-та обекта е:' + " "  + (distancebetweenobjects) + 'км');

}

distanceTime(['50' ,'32' ,'2']);
