// 7. Разстояние между точките
// Напишете JS функция, която изчислява разстоянието между две точки по зададени x и y
// координати. Използвайте обекти, за да съхраните двете точки.
//     Входът идва като масив от четири елемента, във формат [x1, y1, x2, y2]. (Не забравяйте да
// прехвърлите елементите на масива към число) . Всяка двойка елементи са координатите на
// точка в 2D пространство.
//     Изходът трябва да бъде отпечатан на конзолата

function distancePoint([x1, y1, x2, y2]){
    let vectOne = Math.pow((Number(x2) - Number(x1)), 2);
    let vectTwo = Math.pow((Number(y2) - Number(y1)), 2);

    let result = Math.sqrt(vectOne + vectTwo);

    console.log(result);
}

distancePoint(['2', '4', '5', '0']);